# coding=utf-8
import time
__author__ = 'zsw'

# 各种数据类型的通用数据

# INT   -1, 0, 1 -2147483648~2147483647
INT_ZERO = 0
INT_NEGATIVE = -1
INT_POSITIVE = 1
INT_LARGE = 2147483647
INT_TOO_LARGE = 123456789123

# FLOAT  -0.5,0.0,0.5,-0.05,0.00,0.05
FLOAT_NEGATIVE = -0.5
FLOAT_POSITIVE = 0.5
FLOAT_ZERO = 0.0

# CHAR   a,z,A,Z,*,!,-,=,0,9
CHAR_A = "A"
CHAR_A_LOWER = "a"
CHAR_0 = "0"
CHAR_SPECIAL_ASTERISK = "*"
CHAR_SPECIAL_SLASH = "/"
CHAR_SPECIAL_BACKSLASH = "\\"
CHAR_SPECIAL_UNDERLINE = "_"

# STRING     abc123+-=-
STRING_EMPTY = ""
STRING_LETTER = "ABC"
STRING_NUMBER = "123"
STRING_SPECIAL = "!@#$%^&*()_+-=/"
STRING_LIST = "[]"
STRING_DICT = "{}"
STRING_LEN_16 = "ABCDEFGHIJKLMNOP"
STRING_LEN_120 = "".ljust(120, 's')

# LIST   []
LIST_EMPTY = []
LIST_NUMBER = [0, 1, 2]
LIST_STRING = ["A1", "B2", "C3"]
LIST_MIX = [0, "A1", 2]

# DICT  {}
DICT_EMPTY = {}

# NONE
NONE = None

# BOOL
BOOL_TRUE = True
BOOL_FALSE = False

# SPECIAL
# timestamp
TIMESTAMP_NOW_MILLSECOND = int(time.time()*1000)
TIMESTAMP_NOW_SECOND = int(time.time())

# ip
IP_FULL_0 = "0.0.0.0"
IP_FULL_255 = "255.255.255.255"
IP_OVERFLOW = "255.255.255.256"
IP_LOCAL = "127.0.0.1"
IP_COMMON = "101.81.15.3"  # 上海市 电信

# uuid
UUID_FULL_ZERO = "".zfill(32)
UUID_FULL_F = "".ljust(32, 'F')
UUID_LOWER = "".ljust(32, 'a')
UUID_NOT_HEX = "ABCDEFGHIJKLMNOPQRSTUVWXYZ01234567"
UUID_LEN_31 = "".ljust(31, 'A')
UUID_LEN_33 = "".ljust(33, 'A')

# isp
ISP_100017 = "100017"
ISP_100026 = "100026"
ISP_000000 = "000000"

# province
PROVINCE_SH = "310000"
PROVINCE_BJ = "110000"
PROVINCE_GD = "440000"

PROVINCE_LIST = [
    "110000",  # 北京市
    "120000",  # 天津市
    "130000",  # 河北省
    "140000",  # 山西省
    "150000",  # 内蒙古自治区

    "210000",  # 辽宁省
    "220000",  # 吉林省
    "230000",  # 黑龙江省

    "410000",  # 河南省
    "420000",  # 湖北省
    "430000",  # 湖南省

    "610000",  # 陕西省
    "620000",  # 甘肃省
    "630000",  # 青海省
    "640000",  # 宁夏回族自治区
    "650000",  # 新疆维吾尔自治区

    "370000",  # 山东省

    "310000",  # 上海市
    "320000",  # 江苏省
    "330000",  # 浙江省
    "340000",  # 安徽省
    "350000",  # 福建省
    "360000",  # 江西省

    "440000",  # 广东省
    "460000",  # 海南省

    "500000",  # 重庆市
    "510000",  # 四川省
    "520000",  # 贵州省
    "530000",  # 云南省
    "540000",  # 西藏自治区

    "450000",  # 广西壮族自治区

    "999077",  # 香港特别行政区
    "999078",  # 澳门特别行政区
    "999079",  # 台湾省
    "-1"  # Taoba IPDATA
]

PROVINCE_IP_LIST = {
        "110000": ["14.130.0.0", "1.202.0.0", "114.240.0.0", "14.131.255.255"],  # 北京市 default 100017 100026
        "120000": ["27.112.0.0", "27.112.63.255"],  # 天津市
        "130000": ["14.197.150.0", "14.197.159.255"],  # 河北省
        "140000": ["36.192.28.0", "36.192.35.255"],  # 山西省
        "150000": ["1.24.0.0", "1.24.7.255"],  # 内蒙古自治区
        "210000": ["60.16.0.0", "60.16.0.255"],  # 辽宁省
        "220000": ["1.13.0.0", "1.13.63.255"],  # 吉林省
        "230000": ["1.56.96.0", "1.56.97.255"],  # 黑龙江省
        "310000": ["60.63.0.0", "60.63.7.255"],  # 上海市
        "320000": ["1.51.16.0", "1.51.31.255"],  # 江苏省
        "330000": ["60.12.0.0", "60.12.6.169"],  # 浙江省
        "340000": ["60.166.0.0", "60.166.4.255"],  # 安徽省
        "350000": ["1.0.1.0", "1.0.3.255"],  # 福建省
        "360000": ["36.192.195.0", "36.192.200.255"],  # 江西省
        "370000": ["1.51.128.0", "1.51.159.255"],  # 山东省
        "410000": ["1.192.0.0", "1.192.7.255"],  # 河南省
        "420000": ["14.29.123.32", "14.29.123.79"],  # 湖北省
        "430000": ["36.193.9.0", "36.193.13.255"],  # 湖南省
        "440000": ["1.185.96.0", "1.185.191.255"],  # 广东省
        "450000": ["1.185.0.0", "1.185.95.255"],  # 广西壮族自治区
        "460000": ["36.193.76.0", "36.193.77.255"],  # 海南省
        "500000": ["36.193.78.0", "36.193.83.255"],  # 重庆市
        "510000": ["36.193.84.0", "36.193.97.255"],  # 四川省
        "520000": ["1.204.96.0", "1.204.122.255"],  # 贵州省
        "530000": ["36.193.103.0", "36.193.109.255"],  # 云南省
        "540000": ["43.242.164.0", "43.242.167.255"],  # 西藏自治区
        "610000": ["1.80.0.0", "1.80.155.255"],  # 陕西省
        "620000": ["43.243.4.0", "43.243.7.255"],  # 甘肃省
        "630000": ["49.209.64.0", "49.209.127.255"],  # 青海省
        "640000": ["1.50.0.0", "1.50.183.255"],  # 宁夏回族自治区

        "650000": ["58.207.64.0", "58.207.67.255"],  # 新疆维吾尔自治区
        "999077": ["59.148.0.0", "59.149.255.255"],  # 香港特别行政区
        "999078": ["60.246.0.0", "60.246.255.255"],  # 澳门特别行政区
        "999079": ["1.160.0.0", "1.175.255.255"],  # 台湾省
        "-1": ["127.0.0.1", "192.168.1.1", "192.168.1.255", "10.5.0.1"]
}

